cfg/DataProcessors/АвтоПолучениеОтправкаЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>АвтоПолучениеОтправкаЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>УчетныеЗаписиАвтоматическогоТранспортаПисем</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УчетнаяЗапись</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПоследнегоПолучения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнтервалОбновления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭлектроннойПочты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cfg/Enums/ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеИОтправка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfg/DataProcessors/АвтоПолучениеОтправкаЭлектронныхПисем/Forms/Форма/Ext/Form/Module.bsl
Процедура ПроверкаПисем()

	ОтключитьОбработчикОжидания("ПроверкаПисем");
	
	МассивОбработанныхСтрок = Новый Массив;
	
	Для каждого СтрокаТЧ Из УчетныеЗаписиАвтоматическогоТранспортаПисем Цикл
		Если СтрокаТЧ.ВремяПоследнегоПолучения + СтрокаТЧ.ИнтервалОбновления*60 > ТекущаяДата() Тогда
			Продолжить;
		КонецЕсли;
		МассивОбработанныхСтрок.Добавить(СтрокаТЧ);
	КонецЦикла;
	
	Если МассивОбработанныхСтрок.Количество() > 0 Тогда
		Состояние(НСтр("ru='Производится отправка/получение писем ...';uk='Провадиться відправлення/одержання листів ...'"));
		Для каждого СтрокаТЧ Из МассивОбработанныхСтрок Цикл
			МассивУчетныхЗаписей = Новый Массив;
			МассивУчетныхЗаписей.Добавить(СтрокаТЧ.УчетнаяЗапись);
			Если СтрокаТЧ.Действие = Перечисления.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.Получение Тогда
				УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"), МассивУчетныхЗаписей,, Ложь, Истина, Ложь);
			ИначеЕсли СтрокаТЧ.Действие = Перечисления.ВидыДействийАвтоПолученияОтправкиЭлектронныхПисем.Отправка Тогда
				УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"), МассивУчетныхЗаписей,, Истина, Ложь, Ложь);
			Иначе
				УправлениеЭлектроннойПочтой.ПолучениеОтправкаПисем(глЗначениеПеременной("глСоответствиеТекстовЭлектронныхПисем"), глЗначениеПеременной("глТекущийПользователь"), МассивУчетныхЗаписей,, Истина, Истина, Ложь);
			КонецЕсли; 
			СтрокаТЧ.ВремяПоследнегоПолучения = ТекущаяДата();
		КонецЦикла; 
		Оповестить("РоботПолученияПисем");
	КонецЕсли; 
	
	Состояние("");
	
	ПодключитьОбработчикОжидания("ПроверкаПисем", 1);

КонецПроцедуры

Процедура КоманднаяПанельФормыОбновить(Кнопка)
	
	ОтключитьОбработчикОжидания("ПроверкаПисем");
	ОбновитьСписок();
	
КонецПроцедуры

Процедура ОбновитьСписок() Экспорт

	ОбновитьСписокУчетныхЗаписей();
	Если УчетныеЗаписиАвтоматическогоТранспортаПисем.Количество() > 0 Тогда
		ПодключитьОбработчикОжидания("ПроверкаПисем", 1);
	КонецЕсли;

КонецПроцедуры

ОбновитьСписок();
